//Написать программу, в которой объявить и присвоить начальные значения целочисленному массиву a[100].
// Используя конструкцию parallel for и reduction вычислить средние арифметические значения элементов массива a.
// Одно при помощи reduction другое без. Сравнить полученные значения, результат выдать на экран.

#include <omp.h>
#include <stdio.h>

int main() {
    int a[100] = {20, 90, 80, 70, 60, 50, 40, 30, 20, 10,
                  21, 91, 81, 71, 61, 51, 41, 31, 21, 11,
                  22, 92, 82, 72, 62, 52, 42, 32, 22, 12,
                  23, 92, 83, 73, 63, 53, 43, 33, 23, 13,
                  24, 94, 84, 74, 64, 54, 44, 34, 24, 14,
                  25, 95, 85, 75, 65, 55, 45, 35, 25, 15,
                  26, 96, 86, 76, 66, 56, 46, 36, 26, 16,
                  27, 97, 87, 77, 67, 57, 47, 37, 27, 17,
                  28, 98, 88, 78, 68, 58, 48, 38, 28, 18,
                  39, 99, 89, 79, 69, 59, 49, 39, 29, 19};

    int sum_with = 0, sum_without = 0;
#pragma omp parallel for reduction(+: sum_with)
    for (int i = 0; i < 100; i++) {
        sum_with += a[i];
    }

#pragma omp parallel for
    for (int i = 0; i < 100; i++) {
        sum_without += a[i];
    }

    printf("%d %d\n", sum_with, sum_without);
}
